cocoasuny/nRF51822/source/Application/include.h
/**
  ****************************************************************************************
  * @file    include.h
  * @author  Jason
  * @version V1.0.0
  * @date    2016-11-25
  * @brief   include header
  ****************************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2016 Chengdu CloudCare Healthcare Co., Ltd.</center></h2>
  *
  ****************************************************************************************
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __INCLUDE_H
#define __INCLUDE_H

#include <stdint.h>
#include <string.h>
#include "shell.h"
#include "platform.h"
#include "bsp.h"
#include "nrf_drv_clock.h"
#include "ble_hci.h"
#include "ble_conn_state.h"
#include "ble_db_discovery.h"
#include "ble_gap.h"
#include "app_uart.h"
#include "nordic_common.h"
#include "app_error.h"
#include "softdevice_handler_appsh.h"
#include "app_scheduler.h"
#include "system_info_test.h"
#include "ble_db_discovery.h"
#include "ble_conn_params.h"
#include "app_timer.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "fstorage.h"
#include "nrf_sdm.h"
#include "softdevice_handler_appsh.h"
#include "bsp_uart.h"
#include "bsp_led.h"
#include "app_timer_appsh.h"
#include <time.h>
#include "ble_central_service_comm.h"
#include "main.h"
#include "ble_top_implementation.h"
#include "ble_central_manage.h"
#include "ble_central_service_bonding.h"
#include "ble_central_service_devinfo_manage.h"
#include "ble_central_service_monitor_template.h"
#include "ble_central_service_sync_data.h"
#include "nrf_delay.h"
#include "app_device_manage.h"
#include "app_data_sync.h"
#include "bsp_spis.h"




#endif /* __INCLUDE_H */

/************************ (C) COPYRIGHT Chengdu CloudCare Healthcare Co., Ltd. *****END OF FILE****/

